DataProcessors/ИнтеграцияССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияССайтом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиДоступаКСайту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьПараметрыДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/НастройкиДоступаКСайту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>НастройкиДоступаКСайту</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайловыйРесурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидШаблонаСайта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСайта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИнтеграцияССайтом/Forms/НовостиСайта/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ИнтеграцияССайтом"));
	
	ТекОбъект.ИнициализацияРеквизитов();
	
	ЗначениеВДанныеФормы(ТекОбъект, Объект);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриОткрытии(Отказ)
	
	ПодключитьсяКСтраницеСайта();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Обработчик события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьРеквизиты();
	
КонецПроцедуры // ПередЗакрытием()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Обработчик события "Нажатие" гиперссылки "НадписьСтраницаРедактированияНовостей".
//
Процедура НадписьСтраницаРедактированияНовостейНажатие(Элемент)
	
	ПодключитьсяКСтраницеСайта();
	
КонецПроцедуры // НадписьСтраницаРедактированияНовостейНажатие()

&НаКлиенте
// Обработчик события "Нажатие" гиперссылки "НадписьГлавнаяСтраницаСайта".
//
Процедура НадписьГлавнаяСтраницаСайтаНажатие(Элемент)
	
	ПодключитьсяКСтраницеСайта(Ложь);
	
КонецПроцедуры // НадписьГлавнаяСтраницаСайтаНажатие()

&НаКлиенте
// Обработчик события "Нажатие" поля выбора "НастройкаДоступа".
//
Процедура НастройкаДоступаПриИзменении(Элемент)
	
	ПодключитьсяКСтраницеСайта();
	
КонецПроцедуры // НастройкаДоступаПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Сохраняет настройки пользователя в хранилище настроек.
//
Процедура СохранитьРеквизиты()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкаДоступа",          Объект.НастройкаДоступа);
	СтруктураНастроек.Вставить("ОбновлятьПараметрыДоступа", Объект.ОбновлятьПараметрыДоступа);
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.ИнтеграцияССайтом", , СтруктураНастроек);
	
КонецПроцедуры // СохранитьРеквизиты()

&НаСервере
// Формирует структуру с параметрами подключения к сайту.
//
Процедура ЗаполнитьПараметрыПодключения()
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("АдресСайта",    Объект.НастройкаДоступа.АдресСайта);
	ПараметрыПодключения.Вставить("Логин",         Объект.НастройкаДоступа.Логин);
	ПараметрыПодключения.Вставить("Пароль",        Объект.НастройкаДоступа.Пароль);
	ПараметрыПодключения.Вставить("ХранитьПароль", Объект.НастройкаДоступа.ХранитьПароль);
	
КонецПроцедуры // ЗаполнитьПараметрыПодключения()

&НаКлиенте
// Устанавливает в HTML-документ адрес необходимой страницы сайта.
//
// Параметры:
//  РедактироватьНовости - Булево - признак того, что требуется открыть страницу редактирования новостей.
//
Процедура ПодключитьсяКСтраницеСайта(РедактироватьНовости = Истина)
	
	Если Объект.НастройкаДоступа = ПредопределенноеЗначение("Справочник.НастройкиДоступаКСайту.ПустаяСсылка") Тогда
		АдресСтраницы = "";
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыПодключения();
	
	Если ПараметрыПодключения.ХранитьПароль Тогда
		Пароль = ПараметрыПодключения.Пароль;
	Иначе
		Пароль = ПолучитьПарольДоступа();
		Если ТипЗнч(Пароль) = Тип("КодВозвратаДиалога") Тогда
			Пароль = "";
		КонецЕсли;
	КонецЕсли;
	
	АдресСтраницы = ВебИнтеграцияОбщегоНазначения.ПолучитьАдресСтраницы(РедактироватьНовости,
																	   ПараметрыПодключения.АдресСайта,
																	   ПараметрыПодключения.Логин,
																	   Пароль);
	
КонецПроцедуры // ПодключитьсяКСтраницеСайта()

&НаКлиенте
// Открывает форму для ввода пароля.
Функция ПолучитьПарольДоступа()
	
	Возврат ОткрытьФормуМодально("ОбщаяФорма.ВебИнтеграцияВводПароля");
	
КонецФункции // ПолучитьПарольДоступа()
